1s/ERP/Conf/Documents/Лико_ЗакрытиеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗакрытиеЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыРаскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказРаскрой</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЭтапыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЭтапыЗаказа</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПричиныБлокировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОСтатусеПоказанаНаТачпаде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиЭтапа</Name>
					<Comment>Заполняется при перемещении заказа через обработку "Этапы заказов"</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОпределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатПодАппликатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗакрытиеЗаказа/Ext/ManagerModule.bsl
#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации021025(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказа.Дата КАК Период,
	|	Лико_ЗакрытиеЗаказа.Номер КАК Номер,
	|	Лико_ЗакрытиеЗаказа.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа КАК Лико_ЗакрытиеЗаказа
	|ГДЕ
	|	Лико_ЗакрытиеЗаказа.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);	
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Массив = Новый Массив();
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Omega);
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Cartes);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",    		Массив);
    Запрос.УстановитьПараметр("Состояние",    				Перечисления.Лико_СостоянияЗаказов.Закрыт);
    Запрос.УстановитьПараметр("ТипЗаказа",    				Перечисления.Лико_ТипыЗаказов.Полуфабрикат);
	Запрос.УстановитьПараметр("ТипЗаказаУпаковка",    		Перечисления.Лико_ТипыЗаказов.Упаковка);
	
	 
	 Массив = Новый Массив();
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 01"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 02"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Перемотка"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Ротофлекс"));     
	Запрос.УстановитьПараметр("МассивНПЦУ",    		Массив);

	
КонецПроцедуры


Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект)
	
	ДокументСсылка = ДокументОбъект.Ссылка;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказа.Дата КАК Период,
	|	Лико_ЗакрытиеЗаказа.Номер КАК Номер,
	|	Лико_ЗакрытиеЗаказа.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа КАК Лико_ЗакрытиеЗаказа
	|ГДЕ
	|	Лико_ЗакрытиеЗаказа.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();



	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);	
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Массив = Новый Массив();
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Omega);
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Cartes);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",    		Массив);
	Запрос.УстановитьПараметр("Состояние",    				Перечисления.Лико_СостоянияЗаказов.Закрыт);
	Запрос.УстановитьПараметр("ТипЗаказа",    				Перечисления.Лико_ТипыЗаказов.Полуфабрикат);

	Массив = Новый Массив();
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 01"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 02"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Перемотка"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Ротофлекс"));     
	Запрос.УстановитьПараметр("МассивНПЦУ",    		Массив);
	Запрос.УстановитьПараметр("ТипЗаказаУпаковка",    		Перечисления.Лико_ТипыЗаказов.Упаковка);



КонецПроцедуры



Функция ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыВЯчейках";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Назначение КАК Назначение,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличии,
	|	ТоварыВЯчейкахОстатки.КОтборуОстаток КАК КОтбору,
	|	ТоварыВЯчейкахОстатки.КРазмещениюОстаток КАК КРазмещению
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия.ЯССМ_ОбъектНоменклатуры.Рулонный) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗакрытиеЗаказаЗаказы.Заказ = ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры
	|ГДЕ
	|	(ТоварыВЯчейкахОстатки.Ячейка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					РабочиеЦентры.ЛикоЯчейка КАК ЛикоЯчейка
	|				ИЗ
	|					Справочник.РабочиеЦентры КАК РабочиеЦентры
	|				ГДЕ
	|					РабочиеЦентры.ВидРабочегоЦентра В (&ВидРабочегоЦентра))
	|			ИЛИ ТоварыВЯчейкахОстатки.Ячейка В (&МассивНПЦУ))
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.Состояние = &Состояние
	|	И Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа <> &ТипЗаказа
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа <> &ТипЗаказаУпаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Назначение,
	|	ТоварыВЯчейкахОстатки.Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка,
	|	ТоварыВЯчейкахОстатки.Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток,
	|	ТоварыВЯчейкахОстатки.КОтборуОстаток,
	|	ТоварыВЯчейкахОстатки.КРазмещениюОстаток
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия.ЯССМ_ОбъектНоменклатуры.Рулонный) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗакрытиеЗаказаЗаказы.Заказ = ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.Состояние = &Состояние
	|	И Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа = &ТипЗаказаУпаковка
	|	И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти




/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

Процедура УстановитьДатуОбработкиЭтаповВРегистреЭтапыЗаказа(МассивЗаказов, МассивЭтаповВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ЭтапыЗаказа.Период КАК Период,
	|	Лико_ЭтапыЗаказа.Заказ КАК Заказ,
	|	Лико_ЭтапыЗаказа.Площадка КАК Площадка
	|ИЗ
	|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
	|ГДЕ
	|	Лико_ЭтапыЗаказа.Заказ В(&СписокЗаказов)
	|	И Лико_ЭтапыЗаказа.Этап В (&СписокЭтапов)
	|	И Лико_ЭтапыЗаказа.Период >= &ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа
	|	И Лико_ЭтапыЗаказа.ДатаОбработкиЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа", Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа.ЗначениеПараметра);
	Запрос.УстановитьПараметр("СписокЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("СписокЭтапов", МассивЭтаповВыполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ДатаОбработкиЭтапа = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


   
//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
   МеханизмыДокумента.Добавить("АдресныйСклад");
   МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры


// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции
 


//- <--- Лико2.5 m.shenderov 30.03.2022
